{
    "welcome": "Welcome!",
    "meTitle": "I am a Frontend Developer",
    "meInformation": "...who loves what she does, keen to keep learning and interested in working on new projects.",
    "skillsTitle": "Skills",
    "profileTitle": "Profile",
    "basicInformation": "Basic Information",
    "birthday": "Birthday",
    "birthdayText":"1993",
    "locationInformation": "Location",
    "locationInformationText":"Dubai",
    "education": "Education",
    "educationText":"Computer Science, METU",
    "position": "Position",
    "positionText":"Frontend Developer",
    "aboutMe": "About Me",
    "aboutMeInformation": "I am a front end developer who loves what she does, keen to keep learning and interested in working on new projects. Having worked as a Website Coordinator for 5 years I found that what really fueled me was my passion to build websites that are easy to use and look beautiful.",
    "projectsTitle": "Projects",
    "project1Title": "Resume",
    "project1Information": "My resume website allows you to know me and my skills as a frontend developer. While developing the website, utilized Tailwind CSS for modern and responsive styling across the website. Integrated Toastify for user notifications and React i18next for multi-language support. Managed themes and user preferences with Redux and localStorage, and created a secure login form with React Hook Form. Employed protected routes and authentication tokens for security, with data generated through MockAPI and managed using Axios.",
    "viewSite": "View Site",
    "gitHub": "Github",
    "project2Title": "Technological Meals",
    "project2Information": "A simple, customizable website allows your customers to order food by selecting ingredients. This was created with React and used styled-components for CSS management, flexbox for responsive layout, props for data flow, hooks for dynamic and efficient form state management and Cypress for tests.",
    "contactTitle": "Send me a message!",
    "contactTitleInformation": "Got a question or proposal, or just want to say hello? Go ahead.",
    "email": "ozdemirryildizz@gmail.com",
    "loginTitle": "LOGIN",
    "username": "Username",
    "password": "Password",
    "submit": "Submit",
    "requiredUsername": "Please enter username.",
    "requiredPassword": "Please enter at least 8 characters.",
    "moreInfo": "Login for more information!",
    "invalidCredentials": "Please enter the username and password you are registered with in the system.",
    "loginSuccess": "Login successful!",
    "loginFail": "Login failed! Try again."
}