{
    "welcome": "Hoşgeldin!",
    "meTitle": "Frontend Developer olarak,",
    "meInformation": "...işimi severek yapıyorum, öğrenmeye hevesliyim ve yeni projeler üzerinde çalışmaya devam ediyorum.",
    "skillsTitle": "Yetenekler",
    "profileTitle": "Profil",
    "basicInformation": "Temel Bilgiler",
    "birthday": "Doğum Tarihi",
    "birthdayText":"1993",
    "locationInformation": "İkamet Şehri",
    "locationInformationText":"Dubai",
    "education": "Eğitim Durumu",
    "educationText":"ODTÜ BÖTE",
    "position": "Tercih Ettiği Rol",
    "positionText":"Frontend Developer",
    "aboutMe": "Hakkımda",
    "aboutMeInformation": "5 yıl boyunca Web Sitesi Koordinatörü olarak çalıştıktan sonra, beni gerçekten besleyen şeyin, kullanımı kolay ve güzel görünen web siteleri oluşturma tutkum olduğunu fark ettim.",
    "projectsTitle": "Projeler",
    "project1Title": "Özgeçmiş",
    "project1Information": "Özgeçmiş web sitemi geliştirirken frontend geliştirici olarak becerilerim hakkında bilgi edinmenizi amaçladım. Geliştirme sürecinde, modern ve duyarlı bir stil oluşturmak için Tailwind CSS'i kullandım. Kullanıcı bildirimleri için Toastify'ı ve çok dilli destek için React i18next'i entegre ettim. Temaları ve kullanıcı tercihlerini Redux ve localStorage ile yönettim ve React Hook Form ile güvenli bir giriş formu oluşturdum. Güvenlik için korumalı rota ve kimlik doğrulama token'ları kullandım. Ayrıca, verileri MockAPI aracılığıyla oluşturdum ve Axios kullanarak yönettim.",
    "viewSite": "Siteye Git",
    "gitHub": "Github",
    "project2Title": "Teknolojik Yemekler",
    "project2Information": "Müşterilerinizin malzemeleri seçerek yemek sipariş edebileceği basit, özelleştirilebilir bir web sitesi geliştirdim. React ile geliştirdiğim web sitesinde CSS yönetimi için styled-components, duyarlı düzen için flexbox, veri akışı için props, dinamik ve verimli form durumu yönetimi için hooks ve testler için de Cypress kullandım.",
    "contactTitle": "Mesaj Gönder!",
    "contactTitleInformation": "Sorun veya önerin mi var, ya da sadece Merhaba mı demek istiyorsun? Haydi benimle iletişime geç!",
    "email": "ozdemirryildizz@gmail.com",
    "loginTitle": "GİRİŞ YAP",
    "username": "Kullanıcı Adı",
    "password": "Şifre",
    "submit": "Giriş",
    "requiredUsername": "Lütfen kullanıcı adınızı girin.",
    "requiredPassword": "Lütfen en az 8 karakter girin.",
    "moreInfo": "Daha fazlasına erişmek için Giriş Yapın!",
    "invalidCredentials": "Lütfen sisteme kayıtlı olduğunuz kullanıcı adı ve şifrenizi girin.",
    "loginSuccess": "Giriş başarılı!",
    "loginFail": "Giriş başarısız! Yeniden deneyin."
}